app/controllers/application_controller.rb

SELECT "maincarousels".* FROM "maincarousels" ORDER BY "maincarousels"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "logos".* FROM "logos" WHERE "logos"."main" = ?  [["main", 1]]
SELECT "logos".* FROM "logos" WHERE "logos"."main" = ?  [["main", 0]]
---
  def set_variable
  #@organization = Organization.first
    @a = -1
    @time = Time.now
    @main_carousel = Maincarousel.where(id: 2..100)

    @main_carousel_active = Maincarousel.first

    @main_logo = Logo.where(main: true)
    @logo = Logo.where(main: false)

    @main_logo.each do |logo|
      @logo_main = logo
    end
    @logo.each do |logo|