app/controllers/main_controller.rb

  def index
    @mainabout = Mainabout.first
---
SELECT "mainabouts".* FROM "mainabouts" ORDER BY "mainabouts"."id" ASC LIMIT ?  [["LIMIT", 1]]