app/models/user.rb

 def self.find_for_database_authentication(warden_conditions)
   conditions = warden_conditions.dup
   if (login = conditions.delete(:login))
     where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { :value => login.downcase }]).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'admin' OR lower(email) = 'admin') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]